// 2. What is the difference between var and dynamic?

/*
     الفرق بين var و dynamic

     1. var
      - عند استخدام var، يتم تحديد نوع المتغير تلقائيًا أثناء وقت التصنيف (Compile-Time) بناءً على القيمة التي تُسند إليه.
      - بمجرد تحديد نوع المتغير، يصبح ثابتًا ولا يمكن تغييره.
      - لا يمكن إسناد قيمة من نوع مختلف إلى متغير تم تعريفه بـ var بعد تحديد نوعه.


      

      2. dynamic
       - عند استخدام dynamic، يتم تحديد نوع المتغير أثناء وقت التشغيل (Runtime)، وليس أثناء وقت التصنيف.
- يمكن إسناد قيم بأنواع مختلفة إلى نفس المتغير.
- لا يوفر أمان النوع (Type Safety)، مما يعني أن المترجم لا يتحقق من أنواع القيم المسندة للمتغير.

*/