// 5. difference between JIT and AOT?

/*
  الفرق بين JIT و AOT
  1. JIT (Just-In-Time Compilation):
   الترجمة الفورية أثناء وقت التشغيل.
   يتم تحويل الكود Dart إلى كود قابل للتنفيذ أثناء تشغيل البرنامج.
   يستخدم عادة أثناء تطوير التطبيقات لأن الترجمة في وقت التشغيل تسمح بميزات مثل:
    تحديث الكود بسرعة (Hot Reload).
    تصحيح الأخطاء بسرعة أثناء التطوير.


   2. AOT (Ahead-Of-Time Compilation):
    الترجمة المسبقة قبل وقت التشغيل.
يتم تحويل الكود Dart إلى كود أصلي (Native Code) قبل تشغيل التطبيق.
يُستخدم عادةً عند إصدار التطبيقات النهائية (Production).
*/